MikroElektronika/core_packages/PIC/XC8/def/PIC16F18856/mcu.h
extern volatile __bit                   SMT2TMR19           __at(0x2873);	// @ (0x50E * 8 + 3)
#define                                 SMT2TMR19_bit       _BIT_ACCESS(SMT2TMRU,3)
// SMT2TMRL<SMT2TMR2>
extern volatile __bit                   SMT2TMR2            __at(0x2862);	// @ (0x50C * 8 + 2)
#define                                 SMT2TMR2_bit        _BIT_ACCESS(SMT2TMRL,2)
// SMT2TMRU<SMT2TMR20>
extern volatile __bit                   SMT2TMR20           __at(0x2874);	// @ (0x50E * 8 + 4)
#define                                 SMT2TMR20_bit       _BIT_ACCESS(SMT2TMRU,4)
// SMT2TMRU<SMT2TMR21>
extern volatile __bit                   SMT2TMR21           __at(0x2875);	// @ (0x50E * 8 + 5)
#define                                 SMT2TMR21_bit       _BIT_ACCESS(SMT2TMRU,5)
// SMT2TMRU<SMT2TMR22>
extern volatile __bit                   SMT2TMR22           __at(0x2876);	// @ (0x50E * 8 + 6)
#define                                 SMT2TMR22_bit       _BIT_ACCESS(SMT2TMRU,6)
// SMT2TMRU<SMT2TMR23>
extern volatile __bit                   SMT2TMR23           __at(0x2877);	// @ (0x50E * 8 + 7)
#define                                 SMT2TMR23_bit       _BIT_ACCESS(SMT2TMRU,7)
// SMT2TMRL<SMT2TMR3>
extern volatile __bit                   SMT2TMR3            __at(0x2863);	// @ (0x50C * 8 + 3)
#define                                 SMT2TMR3_bit        _BIT_ACCESS(SMT2TMRL,3)
// SMT2TMRL<SMT2TMR4>
extern volatile __bit                   SMT2TMR4            __at(0x2864);	// @ (0x50C * 8 + 4)
#define                                 SMT2TMR4_bit        _BIT_ACCESS(SMT2TMRL,4)
// SMT2TMRL<SMT2TMR5>
extern volatile __bit                   SMT2TMR5            __at(0x2865);	// @ (0x50C * 8 + 5)
#define                                 SMT2TMR5_bit        _BIT_ACCESS(SMT2TMRL,5)
// SMT2TMRL<SMT2TMR6>
extern volatile __bit                   SMT2TMR6            __at(0x2866);	// @ (0x50C * 8 + 6)
#define                                 SMT2TMR6_bit        _BIT_ACCESS(SMT2TMRL,6)
// SMT2TMRL<SMT2TMR7>
extern volatile __bit                   SMT2TMR7            __at(0x2867);	// @ (0x50C * 8 + 7)
#define                                 SMT2TMR7_bit        _BIT_ACCESS(SMT2TMRL,7)
// SMT2TMRH<SMT2TMR8>
extern volatile __bit                   SMT2TMR8            __at(0x2868);	// @ (0x50D * 8 + 0)
#define                                 SMT2TMR8_bit        _BIT_ACCESS(SMT2TMRH,0)
// SMT2TMRH<SMT2TMR9>
extern volatile __bit                   SMT2TMR9            __at(0x2869);	// @ (0x50D * 8 + 1)
#define                                 SMT2TMR9_bit        _BIT_ACCESS(SMT2TMRH,1)
// SMT2STAT<SMT2TS>
extern volatile __bit                   SMT2TS              __at(0x28D2);	// @ (0x51A * 8 + 2)
#define                                 SMT2TS_bit          _BIT_ACCESS(SMT2STAT,2)
// SMT2CON0<SMT2WOL>
extern volatile __bit                   SMT2WOL             __at(0x28C4);	// @ (0x518 * 8 + 4)
#define                                 SMT2WOL_bit         _BIT_ACCESS(SMT2CON0,4)
// SMT2STAT<SMT2WS>
extern volatile __bit                   SMT2WS              __at(0x28D1);	// @ (0x51A * 8 + 1)
#define                                 SMT2WS_bit          _BIT_ACCESS(SMT2STAT,1)
// SMT2WIN<SMT2WSEL0>
extern volatile __bit                   SMT2WSEL0           __at(0x28E8);	// @ (0x51D * 8 + 0)
#define                                 SMT2WSEL0_bit       _BIT_ACCESS(SMT2WIN,0)
// SMT2WIN<SMT2WSEL1>
extern volatile __bit                   SMT2WSEL1           __at(0x28E9);	// @ (0x51D * 8 + 1)
#define                                 SMT2WSEL1_bit       _BIT_ACCESS(SMT2WIN,1)
// SMT2WIN<SMT2WSEL2>
extern volatile __bit                   SMT2WSEL2           __at(0x28EA);	// @ (0x51D * 8 + 2)
#define                                 SMT2WSEL2_bit       _BIT_ACCESS(SMT2WIN,2)
// SMT2WIN<SMT2WSEL3>
extern volatile __bit                   SMT2WSEL3           __at(0x28EB);	// @ (0x51D * 8 + 3)
#define                                 SMT2WSEL3_bit       _BIT_ACCESS(SMT2WIN,3)
// SMT2WIN<SMT2WSEL4>
extern volatile __bit                   SMT2WSEL4           __at(0x28EC);	// @ (0x51D * 8 + 4)
#define                                 SMT2WSEL4_bit       _BIT_ACCESS(SMT2WIN,4)
// SMT1SIGPPS<SMU1SIGPPS0>
extern volatile __bit                   SMU1SIGPPS0         __at(0x7550);	// @ (0xEAA * 8 + 0)
#define                                 SMU1SIGPPS0_bit     _BIT_ACCESS(SMT1SIGPPS,0)
// SMT1SIGPPS<SMU1SIGPPS1>
extern volatile __bit                   SMU1SIGPPS1         __at(0x7551);	// @ (0xEAA * 8 + 1)
#define                                 SMU1SIGPPS1_bit     _BIT_ACCESS(SMT1SIGPPS,1)
// SMT1SIGPPS<SMU1SIGPPS2>
extern volatile __bit                   SMU1SIGPPS2         __at(0x7552);	// @ (0xEAA * 8 + 2)
#define                                 SMU1SIGPPS2_bit     _BIT_ACCESS(SMT1SIGPPS,2)
// SMT1SIGPPS<SMU1SIGPPS3>
extern volatile __bit                   SMU1SIGPPS3         __at(0x7553);	// @ (0xEAA * 8 + 3)
#define                                 SMU1SIGPPS3_bit     _BIT_ACCESS(SMT1SIGPPS,3)
// SMT1SIGPPS<SMU1SIGPPS4>
extern volatile __bit                   SMU1SIGPPS4         __at(0x7554);	// @ (0xEAA * 8 + 4)
#define                                 SMU1SIGPPS4_bit     _BIT_ACCESS(SMT1SIGPPS,4)
// SMT1WINPPS<SMU1WINPPS0>
extern volatile __bit                   SMU1WINPPS0         __at(0x7548);	// @ (0xEA9 * 8 + 0)
#define                                 SMU1WINPPS0_bit     _BIT_ACCESS(SMT1WINPPS,0)
// SMT1WINPPS<SMU1WINPPS1>
extern volatile __bit                   SMU1WINPPS1         __at(0x7549);	// @ (0xEA9 * 8 + 1)
#define                                 SMU1WINPPS1_bit     _BIT_ACCESS(SMT1WINPPS,1)
// SMT1WINPPS<SMU1WINPPS2>
extern volatile __bit                   SMU1WINPPS2         __at(0x754A);	// @ (0xEA9 * 8 + 2)
#define                                 SMU1WINPPS2_bit     _BIT_ACCESS(SMT1WINPPS,2)
// SMT1WINPPS<SMU1WINPPS3>
extern volatile __bit                   SMU1WINPPS3         __at(0x754B);	// @ (0xEA9 * 8 + 3)
#define                                 SMU1WINPPS3_bit     _BIT_ACCESS(SMT1WINPPS,3)
// SMT1WINPPS<SMU1WINPPS4>
extern volatile __bit                   SMU1WINPPS4         __at(0x754C);	// @ (0xEA9 * 8 + 4)
#define                                 SMU1WINPPS4_bit     _BIT_ACCESS(SMT1WINPPS,4)
// SMT2SIGPPS<SMU2SIGPPS0>
extern volatile __bit                   SMU2SIGPPS0         __at(0x7560);	// @ (0xEAC * 8 + 0)
#define                                 SMU2SIGPPS0_bit     _BIT_ACCESS(SMT2SIGPPS,0)
// SMT2SIGPPS<SMU2SIGPPS1>
extern volatile __bit                   SMU2SIGPPS1         __at(0x7561);	// @ (0xEAC * 8 + 1)
#define                                 SMU2SIGPPS1_bit     _BIT_ACCESS(SMT2SIGPPS,1)
// SMT2SIGPPS<SMU2SIGPPS2>
extern volatile __bit                   SMU2SIGPPS2         __at(0x7562);	// @ (0xEAC * 8 + 2)
#define                                 SMU2SIGPPS2_bit     _BIT_ACCESS(SMT2SIGPPS,2)
// SMT2SIGPPS<SMU2SIGPPS3>
extern volatile __bit                   SMU2SIGPPS3         __at(0x7563);	// @ (0xEAC * 8 + 3)
#define                                 SMU2SIGPPS3_bit     _BIT_ACCESS(SMT2SIGPPS,3)
// SMT2SIGPPS<SMU2SIGPPS4>
extern volatile __bit                   SMU2SIGPPS4         __at(0x7564);	// @ (0xEAC * 8 + 4)
#define                                 SMU2SIGPPS4_bit     _BIT_ACCESS(SMT2SIGPPS,4)
// SMT2WINPPS<SMU2WINPPS0>
extern volatile __bit                   SMU2WINPPS0         __at(0x7558);	// @ (0xEAB * 8 + 0)
#define                                 SMU2WINPPS0_bit     _BIT_ACCESS(SMT2WINPPS,0)
// SMT2WINPPS<SMU2WINPPS1>
extern volatile __bit                   SMU2WINPPS1         __at(0x7559);	// @ (0xEAB * 8 + 1)
#define                                 SMU2WINPPS1_bit     _BIT_ACCESS(SMT2WINPPS,1)
// SMT2WINPPS<SMU2WINPPS2>
extern volatile __bit                   SMU2WINPPS2         __at(0x755A);	// @ (0xEAB * 8 + 2)
#define                                 SMU2WINPPS2_bit     _BIT_ACCESS(SMT2WINPPS,2)
// SMT2WINPPS<SMU2WINPPS3>
extern volatile __bit                   SMU2WINPPS3         __at(0x755B);	// @ (0xEAB * 8 + 3)
#define                                 SMU2WINPPS3_bit     _BIT_ACCESS(SMT2WINPPS,3)
// SMT2WINPPS<SMU2WINPPS4>
extern volatile __bit                   SMU2WINPPS4         __at(0x755C);	// @ (0xEAB * 8 + 4)
#define                                 SMU2WINPPS4_bit     _BIT_ACCESS(SMT2WINPPS,4)
// OSCSTAT<SOR>
extern volatile __bit                   SOR                 __at(0x4483);	// @ (0x890 * 8 + 3)
#define                                 SOR_bit             _BIT_ACCESS(OSCSTAT,3)
// OSCEN<SOSCEN>
extern volatile __bit                   SOSCEN              __at(0x448B);	// @ (0x891 * 8 + 3)
#define                                 SOSCEN_bit          _BIT_ACCESS(OSCEN,3)
// OSCCON3<SOSCPWR>
extern volatile __bit                   SOSCPWR             __at(0x447E);	// @ (0x88F * 8 + 6)
#define                                 SOSCPWR_bit         _BIT_ACCESS(OSCCON3,6)
// RC1STA<SPEN>
extern volatile __bit                   SPEN                __at(0x8EF);	// @ (0x11D * 8 + 7)
#define                                 SPEN_bit            _BIT_ACCESS(RC1STA,7)
// RC1STA<SREN>
extern volatile __bit                   SREN                __at(0x8ED);	// @ (0x11D * 8 + 5)
#define                                 SREN_bit            _BIT_ACCESS(RC1STA,5)
// SSP1CLKPPS<SSP1CLKPPS0>
extern volatile __bit                   SSP1CLKPPS0         __at(0x7628);	// @ (0xEC5 * 8 + 0)
#define                                 SSP1CLKPPS0_bit     _BIT_ACCESS(SSP1CLKPPS,0)
// SSP1CLKPPS<SSP1CLKPPS1>
extern volatile __bit                   SSP1CLKPPS1         __at(0x7629);	// @ (0xEC5 * 8 + 1)
#define                                 SSP1CLKPPS1_bit     _BIT_ACCESS(SSP1CLKPPS,1)
// SSP1CLKPPS<SSP1CLKPPS2>
extern volatile __bit                   SSP1CLKPPS2         __at(0x762A);	// @ (0xEC5 * 8 + 2)
#define                                 SSP1CLKPPS2_bit     _BIT_ACCESS(SSP1CLKPPS,2)
// SSP1CLKPPS<SSP1CLKPPS3>
extern volatile __bit                   SSP1CLKPPS3         __at(0x762B);	// @ (0xEC5 * 8 + 3)
#define                                 SSP1CLKPPS3_bit     _BIT_ACCESS(SSP1CLKPPS,3)
// SSP1CLKPPS<SSP1CLKPPS4>
extern volatile __bit                   SSP1CLKPPS4         __at(0x762C);	// @ (0xEC5 * 8 + 4)
#define                                 SSP1CLKPPS4_bit     _BIT_ACCESS(SSP1CLKPPS,4)
// SSP1DATPPS<SSP1DATPPS0>
extern volatile __bit                   SSP1DATPPS0         __at(0x7630);	// @ (0xEC6 * 8 + 0)
#define                                 SSP1DATPPS0_bit     _BIT_ACCESS(SSP1DATPPS,0)
// SSP1DATPPS<SSP1DATPPS1>
extern volatile __bit                   SSP1DATPPS1         __at(0x7631);	// @ (0xEC6 * 8 + 1)
#define                                 SSP1DATPPS1_bit     _BIT_ACCESS(SSP1DATPPS,1)
// SSP1DATPPS<SSP1DATPPS2>
extern volatile __bit                   SSP1DATPPS2         __at(0x7632);	// @ (0xEC6 * 8 + 2)
#define                                 SSP1DATPPS2_bit     _BIT_ACCESS(SSP1DATPPS,2)
// SSP1DATPPS<SSP1DATPPS3>
extern volatile __bit                   SSP1DATPPS3         __at(0x7633);	// @ (0xEC6 * 8 + 3)
#define                                 SSP1DATPPS3_bit     _BIT_ACCESS(SSP1DATPPS,3)
// SSP1DATPPS<SSP1DATPPS4>
extern volatile __bit                   SSP1DATPPS4         __at(0x7634);	// @ (0xEC6 * 8 + 4)
#define                                 SSP1DATPPS4_bit     _BIT_ACCESS(SSP1DATPPS,4)
// PIE3<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x38C8);	// @ (0x719 * 8 + 0)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x3878);	// @ (0x70F * 8 + 0)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR3,0)
// SSP1SSPPS<SSP1SSPPS0>
extern volatile __bit                   SSP1SSPPS0          __at(0x7638);	// @ (0xEC7 * 8 + 0)
#define                                 SSP1SSPPS0_bit      _BIT_ACCESS(SSP1SSPPS,0)
// SSP1SSPPS<SSP1SSPPS1>
extern volatile __bit                   SSP1SSPPS1          __at(0x7639);	// @ (0xEC7 * 8 + 1)
#define                                 SSP1SSPPS1_bit      _BIT_ACCESS(SSP1SSPPS,1)
// SSP1SSPPS<SSP1SSPPS2>
extern volatile __bit                   SSP1SSPPS2          __at(0x763A);	// @ (0xEC7 * 8 + 2)
#define                                 SSP1SSPPS2_bit      _BIT_ACCESS(SSP1SSPPS,2)
// SSP1SSPPS<SSP1SSPPS3>
extern volatile __bit                   SSP1SSPPS3          __at(0x763B);	// @ (0xEC7 * 8 + 3)
#define                                 SSP1SSPPS3_bit      _BIT_ACCESS(SSP1SSPPS,3)
// SSP1SSPPS<SSP1SSPPS4>
extern volatile __bit                   SSP1SSPPS4          __at(0x763C);	// @ (0xEC7 * 8 + 4)
#define                                 SSP1SSPPS4_bit      _BIT_ACCESS(SSP1SSPPS,4)
// SSP2CLKPPS<SSP2CLKPPS0>
extern volatile __bit                   SSP2CLKPPS0         __at(0x7640);	// @ (0xEC8 * 8 + 0)
#define                                 SSP2CLKPPS0_bit     _BIT_ACCESS(SSP2CLKPPS,0)
// SSP2CLKPPS<SSP2CLKPPS1>
extern volatile __bit                   SSP2CLKPPS1         __at(0x7641);	// @ (0xEC8 * 8 + 1)
#define                                 SSP2CLKPPS1_bit     _BIT_ACCESS(SSP2CLKPPS,1)
// SSP2CLKPPS<SSP2CLKPPS2>
extern volatile __bit                   SSP2CLKPPS2         __at(0x7642);	// @ (0xEC8 * 8 + 2)
#define                                 SSP2CLKPPS2_bit     _BIT_ACCESS(SSP2CLKPPS,2)
// SSP2CLKPPS<SSP2CLKPPS3>
extern volatile __bit                   SSP2CLKPPS3         __at(0x7643);	// @ (0xEC8 * 8 + 3)
#define                                 SSP2CLKPPS3_bit     _BIT_ACCESS(SSP2CLKPPS,3)
// SSP2CLKPPS<SSP2CLKPPS4>
extern volatile __bit                   SSP2CLKPPS4         __at(0x7644);	// @ (0xEC8 * 8 + 4)
#define                                 SSP2CLKPPS4_bit     _BIT_ACCESS(SSP2CLKPPS,4)
// SSP2DATPPS<SSP2DATPPS0>
extern volatile __bit                   SSP2DATPPS0         __at(0x7648);	// @ (0xEC9 * 8 + 0)
#define                                 SSP2DATPPS0_bit     _BIT_ACCESS(SSP2DATPPS,0)
// SSP2DATPPS<SSP2DATPPS1>
extern volatile __bit                   SSP2DATPPS1         __at(0x7649);	// @ (0xEC9 * 8 + 1)
#define                                 SSP2DATPPS1_bit     _BIT_ACCESS(SSP2DATPPS,1)
// SSP2DATPPS<SSP2DATPPS2>
extern volatile __bit                   SSP2DATPPS2         __at(0x764A);	// @ (0xEC9 * 8 + 2)
#define                                 SSP2DATPPS2_bit     _BIT_ACCESS(SSP2DATPPS,2)
// SSP2DATPPS<SSP2DATPPS3>
extern volatile __bit                   SSP2DATPPS3         __at(0x764B);	// @ (0xEC9 * 8 + 3)
#define                                 SSP2DATPPS3_bit     _BIT_ACCESS(SSP2DATPPS,3)
// SSP2DATPPS<SSP2DATPPS4>
extern volatile __bit                   SSP2DATPPS4         __at(0x764C);	// @ (0xEC9 * 8 + 4)
#define                                 SSP2DATPPS4_bit     _BIT_ACCESS(SSP2DATPPS,4)
// PIE3<SSP2IE>
extern volatile __bit                   SSP2IE              __at(0x38CA);	// @ (0x719 * 8 + 2)
#define                                 SSP2IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<SSP2IF>
extern volatile __bit                   SSP2IF              __at(0x387A);	// @ (0x70F * 8 + 2)
#define                                 SSP2IF_bit          _BIT_ACCESS(PIR3,2)
// SSP2SSPPS<SSP2SSPPS0>
extern volatile __bit                   SSP2SSPPS0          __at(0x7650);	// @ (0xECA * 8 + 0)
#define                                 SSP2SSPPS0_bit      _BIT_ACCESS(SSP2SSPPS,0)
// SSP2SSPPS<SSP2SSPPS1>
extern volatile __bit                   SSP2SSPPS1          __at(0x7651);	// @ (0xECA * 8 + 1)
#define                                 SSP2SSPPS1_bit      _BIT_ACCESS(SSP2SSPPS,1)
// SSP2SSPPS<SSP2SSPPS2>
extern volatile __bit                   SSP2SSPPS2          __at(0x7652);	// @ (0xECA * 8 + 2)
#define                                 SSP2SSPPS2_bit      _BIT_ACCESS(SSP2SSPPS,2)
// SSP2SSPPS<SSP2SSPPS3>
extern volatile __bit                   SSP2SSPPS3          __at(0x7653);	// @ (0xECA * 8 + 3)
#define                                 SSP2SSPPS3_bit      _BIT_ACCESS(SSP2SSPPS,3)
// SSP2SSPPS<SSP2SSPPS4>
extern volatile __bit                   SSP2SSPPS4          __at(0x7654);	// @ (0xECA * 8 + 4)
#define                                 SSP2SSPPS4_bit      _BIT_ACCESS(SSP2SSPPS,4)
// SSP1CON1<SSPEN1>
extern volatile __bit                   SSPEN1              __at(0xC85);	// @ (0x190 * 8 + 5)
#define                                 SSPEN1_bit          _BIT_ACCESS(SSP1CON1,5)
// SSP2CON1<SSPEN2>
extern volatile __bit                   SSPEN2              __at(0xCD5);	// @ (0x19A * 8 + 5)
#define                                 SSPEN2_bit          _BIT_ACCESS(SSP2CON1,5)
// SSP1CON1<SSPM01>
extern volatile __bit                   SSPM01              __at(0xC80);	// @ (0x190 * 8 + 0)
#define                                 SSPM01_bit          _BIT_ACCESS(SSP1CON1,0)
// SSP2CON1<SSPM02>
extern volatile __bit                   SSPM02              __at(0xCD0);	// @ (0x19A * 8 + 0)
#define                                 SSPM02_bit          _BIT_ACCESS(SSP2CON1,0)
// SSP1CON1<SSPM11>
extern volatile __bit                   SSPM11              __at(0xC81);	// @ (0x190 * 8 + 1)
#define                                 SSPM11_bit          _BIT_ACCESS(SSP1CON1,1)
// SSP2CON1<SSPM12>
extern volatile __bit                   SSPM12              __at(0xCD1);	// @ (0x19A * 8 + 1)
#define                                 SSPM12_bit          _BIT_ACCESS(SSP2CON1,1)
// SSP1CON1<SSPM21>
extern volatile __bit                   SSPM21              __at(0xC82);	// @ (0x190 * 8 + 2)
#define                                 SSPM21_bit          _BIT_ACCESS(SSP1CON1,2)
// SSP2CON1<SSPM22>
extern volatile __bit                   SSPM22              __at(0xCD2);	// @ (0x19A * 8 + 2)
#define                                 SSPM22_bit          _BIT_ACCESS(SSP2CON1,2)
// SSP1CON1<SSPM31>
extern volatile __bit                   SSPM31              __at(0xC83);	// @ (0x190 * 8 + 3)
#define                                 SSPM31_bit          _BIT_ACCESS(SSP1CON1,3)
// SSP2CON1<SSPM32>
extern volatile __bit                   SSPM32              __at(0xCD3);	// @ (0x19A * 8 + 3)
#define                                 SSPM32_bit          _BIT_ACCESS(SSP2CON1,3)
// SSP1CON1<SSPOV1>
extern volatile __bit                   SSPOV1              __at(0xC86);	// @ (0x190 * 8 + 6)
#define                                 SSPOV1_bit          _BIT_ACCESS(SSP1CON1,6)
// SSP2CON1<SSPOV2>
extern volatile __bit                   SSPOV2              __at(0xCD6);	// @ (0x19A * 8 + 6)
#define                                 SSPOV2_bit          _BIT_ACCESS(SSP2CON1,6)
// SSP1STAT<START1>
extern volatile __bit                   START1              __at(0xC7B);	// @ (0x18F * 8 + 3)
#define                                 START1_bit          _BIT_ACCESS(SSP1STAT,3)
// SSP2STAT<START2>
extern volatile __bit                   START2              __at(0xCCB);	// @ (0x199 * 8 + 3)
#define                                 START2_bit          _BIT_ACCESS(SSP2STAT,3)
// WDTTMR<STATE>
extern volatile __bit                   STATE               __at(0x4082);	// @ (0x810 * 8 + 2)
#define                                 STATE_bit           _BIT_ACCESS(WDTTMR,2)
// PCON0<STKOVF>
extern volatile __bit                   STKOVF              __at(0x409F);	// @ (0x813 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON0,7)
// PCON0<STKUNF>
extern volatile __bit                   STKUNF              __at(0x409E);	// @ (0x813 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON0,6)
// SSP1STAT<STOP1>
extern volatile __bit                   STOP1               __at(0xC7C);	// @ (0x18F * 8 + 4)
#define                                 STOP1_bit           _BIT_ACCESS(SSP1STAT,4)
// SSP2STAT<STOP2>
extern volatile __bit                   STOP2               __at(0xCCC);	// @ (0x199 * 8 + 4)
#define                                 STOP2_bit           _BIT_ACCESS(SSP2STAT,4)
// WDTCON0<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x4060);	// @ (0x80C * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON0,0)
// PMD0<SYSCMD>
extern volatile __bit                   SYSCMD              __at(0x3CB7);	// @ (0x796 * 8 + 7)
#define                                 SYSCMD_bit          _BIT_ACCESS(PMD0,7)
// T0CON0<T016BIT>
extern volatile __bit                   T016BIT             __at(0xF4);	// @ (0x1E * 8 + 4)
#define                                 T016BIT_bit         _BIT_ACCESS(T0CON0,4)
// T0CON1<T0ASYNC>
extern volatile __bit                   T0ASYNC             __at(0xFC);	// @ (0x1F * 8 + 4)
#define                                 T0ASYNC_bit         _BIT_ACCESS(T0CON1,4)
// T0CKIPPS<T0CKIPPS0>
extern volatile __bit                   T0CKIPPS0           __at(0x7488);	// @ (0xE91 * 8 + 0)
#define                                 T0CKIPPS0_bit       _BIT_ACCESS(T0CKIPPS,0)
// T0CKIPPS<T0CKIPPS1>
extern volatile __bit                   T0CKIPPS1           __at(0x7489);	// @ (0xE91 * 8 + 1)
#define                                 T0CKIPPS1_bit       _BIT_ACCESS(T0CKIPPS,1)
// T0CKIPPS<T0CKIPPS2>
extern volatile __bit                   T0CKIPPS2           __at(0x748A);	// @ (0xE91 * 8 + 2)
#define                                 T0CKIPPS2_bit       _BIT_ACCESS(T0CKIPPS,2)
// T0CKIPPS<T0CKIPPS3>
extern volatile __bit                   T0CKIPPS3           __at(0x748B);	// @ (0xE91 * 8 + 3)
#define                                 T0CKIPPS3_bit       _BIT_ACCESS(T0CKIPPS,3)
// T0CON1<T0CKPS0>
extern volatile __bit                   T0CKPS0             __at(0xF8);	// @ (0x1F * 8 + 0)
#define                                 T0CKPS0_bit         _BIT_ACCESS(T0CON1,0)
// T0CON1<T0CKPS1>
extern volatile __bit                   T0CKPS1             __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 T0CKPS1_bit         _BIT_ACCESS(T0CON1,1)
// T0CON1<T0CKPS2>
extern volatile __bit                   T0CKPS2             __at(0xFA);	// @ (0x1F * 8 + 2)
#define                                 T0CKPS2_bit         _BIT_ACCESS(T0CON1,2)
// T0CON1<T0CKPS3>
extern volatile __bit                   T0CKPS3             __at(0xFB);	// @ (0x1F * 8 + 3)
#define                                 T0CKPS3_bit         _BIT_ACCESS(T0CON1,3)
// T0CON1<T0CS0>
extern volatile __bit                   T0CS0               __at(0xFD);	// @ (0x1F * 8 + 5)
#define                                 T0CS0_bit           _BIT_ACCESS(T0CON1,5)
// T0CON1<T0CS1>
extern volatile __bit                   T0CS1               __at(0xFE);	// @ (0x1F * 8 + 6)
#define                                 T0CS1_bit           _BIT_ACCESS(T0CON1,6)
// T0CON1<T0CS2>
extern volatile __bit                   T0CS2               __at(0xFF);	// @ (0x1F * 8 + 7)
#define                                 T0CS2_bit           _BIT_ACCESS(T0CON1,7)
// T0CON0<T0EN>
extern volatile __bit                   T0EN                __at(0xF7);	// @ (0x1E * 8 + 7)
#define                                 T0EN_bit            _BIT_ACCESS(T0CON0,7)
// T0CON0<T0OUT>
extern volatile __bit                   T0OUT               __at(0xF5);	// @ (0x1E * 8 + 5)
#define                                 T0OUT_bit           _BIT_ACCESS(T0CON0,5)
// T0CON0<T0OUTPS0>
extern volatile __bit                   T0OUTPS0            __at(0xF0);	// @ (0x1E * 8 + 0)
#define                                 T0OUTPS0_bit        _BIT_ACCESS(T0CON0,0)
// T0CON0<T0OUTPS1>
extern volatile __bit                   T0OUTPS1            __at(0xF1);	// @ (0x1E * 8 + 1)
#define                                 T0OUTPS1_bit        _BIT_ACCESS(T0CON0,1)
// T0CON0<T0OUTPS2>
extern volatile __bit                   T0OUTPS2            __at(0xF2);	// @ (0x1E * 8 + 2)
#define                                 T0OUTPS2_bit        _BIT_ACCESS(T0CON0,2)
// T0CON0<T0OUTPS3>
